Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/svd/PIC32CZ4010CA80176.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PAC</name>
         <version>035852b0</version>
         <description>Peripheral Access Controller</description>
         <groupName>PAC</groupName>
         <prependToName>PAC_</prependToName>
         <baseAddress>0x44810000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PAC</name>
            <value>35</value>
         </interrupt>
         <registers>
            <register>
               <name>WRCTRL</name>
               <description>Write control</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PERID</name>
                     <description>Peripheral identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Peripheral access control key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>No action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLR</name>
                           <description>Clear protection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET</name>
                           <description>Set protection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SETLCK</name>
                           <description>Set and lock protection</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event control</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERREO</name>
                     <description>Peripheral acess error event output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt enable clear</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>Peripheral access error interrupt disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt enable set</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>Peripheral access error interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAGAHB</name>
               <description>Bridge interrupt flag status</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>INTFLAGA</name>
               <description>Peripheral interrupt flag status - Bridge A</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DSU_</name>
                     <description>DSU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCW_</name>
                     <description>FCW</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCR_</name>
                     <description>FCR</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PM_</name>
                     <description>PM</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUPC_</name>
                     <description>SUPC</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTC_</name>
                     <description>RSTC</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCCTRL_</name>
                     <description>OSCCTRL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KCTRL_</name>
                     <description>OSC32KCTRL</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCLK_</name>
                     <description>GCLK</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCLK_</name>
                     <description>MCLK</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREQM_</name>
                     <description>FREQM</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_</name>
                     <description>WDT</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_</name>
                     <description>RTC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EIC_</name>
                     <description>EIC</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PAC_</name>
                     <description>PAC</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRMTCM_</name>
                     <description>DRMTCM</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCRAMC_</name>
                     <description>MCRAMC</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRAM_</name>
                     <description>TRAM</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORT_</name>
                     <description>PORT</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_</name>
                     <description>DMA</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRM_</name>
                     <description>PRM</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVSYS_</name>
                     <description>EVSYS</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM0_</name>
                     <description>SERCOM0</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM1_</name>
                     <description>SERCOM1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM2_</name>
                     <description>SERCOM2</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM3_</name>
                     <description>SERCOM3</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM4_</name>
                     <description>SERCOM4</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM5_</name>
                     <description>SERCOM5</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM6_</name>
                     <description>SERCOM6</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM7_</name>
                     <description>SERCOM7</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAGB</name>
               <description>Peripheral interrupt flag status - Bridge B</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCC0_</name>
                     <description>TCC0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC1_</name>
                     <description>TCC1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC2_</name>
                     <description>TCC2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC3_</name>
                     <description>TCC3</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC4_</name>
                     <description>TCC4</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC5_</name>
                     <description>TCC5</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC6_</name>
                     <description>TCC6</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC7_</name>
                     <description>TCC7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC8_</name>
                     <description>TCC8</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC9_</name>
                     <description>TCC9</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_</name>
                     <description>ADC</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AC_</name>
                     <description>AC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTC_</name>
                     <description>PTC</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI_IXS0_</name>
                     <description>SPI_IXS0</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI_IXS1_</name>
                     <description>SPI_IXS1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN0_</name>
                     <description>CAN0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN1_</name>
                     <description>CAN1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN2_</name>
                     <description>CAN2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN3_</name>
                     <description>CAN3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN4_</name>
                     <description>CAN4</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN5_</name>
                     <description>CAN5</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETH_</name>
                     <description>ETH</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRNG_</name>
                     <description>TRNG</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC0_</name>
                     <description>SDMMC0</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMC1_</name>
                     <description>SDMMC1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAGC</name>
               <description>Peripheral interrupt flag status - Bridge C</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MLB_</name>
                     <description>MLB</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
